#ifndef INIT_CONFIGS_H
#define INIT_CONFIGS_H

typedef enum
{
    INIT_SUCCESS,
    INIT_ERROR
} init_status_t;

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////

/*
** Описание: Начальная конфигурация частоты процессора. Источник сигнала: HSE
** Параметры: none
** Возвращаемое значение: результат настройки INIT_SUCCESS или INIT_ERROR
*/
init_status_t cpu_clock_init(void);

/*
** Описание: Начальная конфигурация портов для LCD дисплея
** Параметры: none
** Возвращаемое значение: результат настройки INIT_SUCCESS или INIT_ERROR
*/
init_status_t lcd_ports_init(void);

/*
** Описание: Начальная конфигурация портов для 
** Параметры: none
** Возвращаемое значение: результат настройки INIT_SUCCESS или INIT_ERROR
*/
init_status_t button_ports_init(void);


#endif